app/controllers/movies_controller.rb

  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("name", "created_at", "updated_at", "client_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "The beautifull Best"], ["created_at", "2023-06-30 01:29:06.975674"], ["updated_at", "2023-06-30 01:29:06.975674"], ["client_id", 3]]

    def set_clients
      @clients = Client.all.pluck :name, :id
---
SELECT "clients"."name", "clients"."id" FROM "clients"